"""
+71234567890 Сергей
+71234567810 Сергей
+51234567890 Михаил
+72134567890 Николай
"""
# import sys
# считывание списка из входного потока
# lst_in = list(map(str.strip, sys.stdin.readlines()))

#lst_in = ['+71234567890 Сергей', '+71234567810 Сергей', '+51234567890 Михаил', '+72134567890 Николай']
lst_in = [i.split(sep=' ') for i in lst_in]
# lst_in = [['+71234567890', 'Сергей'], ['+71234567810', 'Сергей'], ['+51234567890', 'Михаил'], ['+72134567890', 'Николай']]
d ={}
d = {i[1]: [j[0] for j in lst_in if j[1] == i[1]] for i in lst_in if i[1] not in d}
# print(d)
print(*sorted(d.items()))